{
  "architectures": [
    "RobertaForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 2,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "B-DT",
    "1": "I-DT",
    "2": "B-LC",
    "3": "I-LC",
    "4": "B-OG",
    "5": "I-OG",
    "6": "B-PS",
    "7": "I-PS",
    "8": "B-QT",
    "9": "I-QT",
    "10": "B-TI",
    "11": "I-TI",
    "12": "O"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-DT": 0,
    "B-LC": 2,
    "B-OG": 4,
    "B-PS": 6,
    "B-QT": 8,
    "B-TI": 10,
    "I-DT": 1,
    "I-LC": 3,
    "I-OG": 5,
    "I-PS": 7,
    "I-QT": 9,
    "I-TI": 11,
    "O": 12
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "tokenizer_class": "BertTokenizer",
  "transformers_version": "4.57.3",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 32000
}
